IdeaRS.OpenModel.Parameters.BoltParam
Parameter which represts the record of the bolt in IDEA MPRL

IdeaRS.OpenModel.Parameters.BoltParam.CoordinateSystem
Gets or sets the coordinate system type.

IdeaRS.OpenModel.Parameters.BoltParam.Positions
Gets or sets the fasteners positions {X, Y}.

IdeaRS.OpenModel.Parameters.BoltParam.Rows
Gets or sets the rows of a fasteners positions.
Absolute positions of groups, in group are relative positions.

IdeaRS.OpenModel.Parameters.BoltParam.Cols
Gets or sets the columns of fasteners positions.

IdeaRS.OpenModel.Parameters.BoltParam.RowsSymmetry
Gets or sets the type of symmetry of rows positions.

IdeaRS.OpenModel.Parameters.BoltParam.ColsSymmetry
Gets or sets the type of symmetry of columns positions.

IdeaRS.OpenModel.Parameters.BoltParam.RowsPosition
Gets or sets the position, to which are bolt rows realted to.

IdeaRS.OpenModel.Parameters.BoltParam.ColsPosition
Gets or sets the position, to which are bolt columns realted to.

IdeaRS.OpenModel.Parameters.BoltParam.RowsGridType
Gets or sets the type of rows - regular or shifted.

IdeaRS.OpenModel.Parameters.BoltParam.ColsGridType
Gets or sets the type of cols - regular or shifted.

IdeaRS.OpenModel.Parameters.BoltParam.PolarInput
Gets or sets the type, that spefifies polar input.

IdeaRS.OpenModel.Parameters.BoltParam.Counts
Gets or sets the count of bolts in the circle (polar coordinate system).

IdeaRS.OpenModel.Parameters.BoltParam.Radii
Gets or sets the radii of bolts (polar coordinate system).

IdeaRS.OpenModel.Parameters.BoltParam.Angles
Gets or sets the groups and positions for angles.

IdeaRS.OpenModel.Parameters.BoltParam.PolarPosition
Gets or sets the position, to which are bolt radii realted to (polar coordinate system).

IdeaRS.OpenModel.Parameters.BoltParam.ShearInThread
Indicates, whether a shear plane is in the thread of a bolt.

IdeaRS.OpenModel.Parameters.BoltParam.BoltInteraction
Indicates type of shear transfer